<!DOCTYPE html>
<html>
<head>
	<title>Redes 2015/2</title>
</head>
<body>
<h1>Redes - 2015/2 - Becsom</h1>
<h4>becsom@fumec.br</h4>
<h2>Distribui&ccedil;&atilde;o dos pontos</h2>
<ul>
	<li>1 avalia&ccedil;&atilde;o - 35 pts</li>
	<li>2 avalia&ccedil;&atilde;o - 30 pts 
		<ul>
			<li>Auto Instrucional - 10 pts</li>
			<li>Listas - 10 pts</li>
			<li>Revis&atilde;o de conte&uacute;do - 10 pts</li>
		</ul>
	</li>
	<li>3 avalia&ccedil;&atilde;o - 35 pts</li>
	<li>Especial - 35 pts</li>
</ul>
<h4>&Iacute;ndice</h4>
<ol>
	<li><a href="#historico"> Hist&oacute;rico </a></li>
	<li><a href="#componentes_basicos_de_uma_rede">Componentes b&aacute;sicos de uma rede</a></li>
	<li><a href="#lan_man_wan">LAN, MAN e WAN</a>
		<ol>
			<li><a href="#lan">LAN</a></li>
			<li><a href="#man">MAN</a></li>
			<li><a href="#wan">WAN</a></li>
		</ol>
	</li>
	<li><a href="#protocolo_de_rede">Protocolo de Rede</a></li>
	<li><a href="#formas_de_ligacao_ao_meio">Formas de Liga&ccedil;&atilde;o ao Meio</a>
		<ol>
			<li><a href="#multiponto">Multiponto</a></li>
			<li><a href="#peer_to_peer">Ponto a Ponto(Peer to Peer)</a></li>
		</ol>
	</li>
	<li><a href="#objetivos_e_vantagens_de_implementacao_de_redes"> Objetivos de vantagens de implementa&ccedil;&atilde;o de redes</a>
		<ol>
			<li><a href="#compartilhamento_de_hardware_e_software">Compartimento de Hardware e Software</a></li>
			<li><a href="#plataforma_para_downsizing_e_rightsizing">Plataforma para Downsizing e Rightsizing</a></li>
			<li><a href="#impl_email_workflow_workgroup">Recursos para implementa&ccedil;&atilde;o de correio eletr&ocirc;nico, agenda eletr&ocirc;nica corporativa, workflow, workgroup, portais, sistemas SSO e ERP(Sistemas de gest&atilde;o empresarial)</a></li>
		</ol>
	</li>
	<li><a href="#comunicacao_simplex_halfduplex_fullduplex">Comunica&ccedil;&atilde;o Simplex, Half Duplex e Full Duplex</a>
		<ol>
			<li><a href="#simplex">Simplex</a></li>
			<li><a href="#half_duplex">Half Duplex</a></li>
			<li><a href="#full_duplex">Full Duplex</a></li>
		</ol>		
	</li>
	<li><a href="#backbone">Backbone</a></li>
	<li><a href="#firewall">Firewall</a></li>
	<li><a href="#dmz">Zona Desmilitarizada</a></li>
	<li><a href="#hub_switch_roteador">Hub, Switch e Roteador</a></li>
	<li><a href="#projeto_de_rede">Projeto de rede</a>
		<ol>
			<li><a href="#projeto_logico">Projeto L&oacute;gico</a></li>
			<li><a href="#projeto_fisico">Projeto F&iacute;sico</a></li>
		</ol>
	</li>
	<li><a href="#internet_intranet_extranet">Internet/Intranet/Extranet</a></li>
	<li><a href="#topologia_de_redes">Topologia de Redes</a></li>
</ol>
<hr>
<h2>Hist&oacute;rico</h2>
<a name="historico"></a>
<ul id= "historico_list">
	<li>Em 1844 - Samuel Morse (C&oacute;digo Morse)</li>
	<li>Em 1876 - Graham Bell (Telefone Comp. Bell)</li>
	<li>At&eacute; 1960/1970 - Computa&ccedil;&atilde;o de grande porte</li>
	<img src="imagens/imagem001.jpeg" width="500px" height="220px">
	<li>Processamento centralizado</li>
	<li>Administra&ccedil;&atilde;o Centralizada</li>
	<li>Uso de terminais</li>
	<img src="imagens/imagem0002.jpeg" width="400px" height="150px">
	<li>Em 1969 - Projeto Arpanet --> Percursor da internet</li>
	<li>In&iacute;cio dos anos 70 - Rede de computadores Aloha</li>
	<li>Meados dos anos 70 - Rede padr&atilde;o ethernet
		<ul>
			<li>Empresa Xerox</li>
		</ul>
	</li>
	<li>Meados dos anos 70 - Rede padr&atilde;o token ring
		<ul>
			<li>Empresa IBM</li>
		</ul>
	</li>
	<li>In&iacute;cio dos anos 80 - Personal Computer</li>
	<li>Nos anos 80, 90 e 2000 surgiram sistemas operacionais para redes de microcompuitadores:
	Novell Netware, Windows NT, Windows 2000, Windows XP, Windows 2003, Linux, Windows 2008, etc.</li>
	<li>Anos 90 - Desenvolvimento do com&eacute;rcio eletr&ocirc;nico e sistemas de seguran&ccedil;a para redes de computadores</li>
	<li>Anos 2000 - Utiliza&ccedil;&atilde;o em larga escala de redes wireless, converg&ecirc;ncia dos sistemas de telefonia de voz e dados, explos&atilde;o do uso das redes sociais por meio de dispositivos m&oacute;veis de comunica&ccedil;&atilde;o</li>
</ul>
<div id="tipos_cabeamento" style="border: black dotted;">
	<h4>Extra: Tipos de cabos</h4>
	<ul>
		<li>Coaxial</li>
		<li>Par tran&ccedil;ado: De f&aacute;cil instala&ccedil;&atilde;o e barato, por&eacute;m pode sofrer facilmente interfer&ecirc;ncia eletromagn&eacute;tica e suas informa&ccedil;&otilde;es podem ser facilmente roubadas</li>
		<li>Fibra: Seguro e r&aacute;pido, &eacute; a melhor op&ccedil;&atilde;o entre os 3, por&eacute;m seu pre&ccedil;o &eacute; elevado</li>
	</ul>
	<p><b>Quanto menor o n&uacute;cleo, menor a dispers&atilde;o modal e mais longe o sinal pode alcan&ccedil;ar</b></p>
</div>
<a name="componentes_basicos_de_uma_rede">
<h2>Componentes b&aacute;sicos de uma rede</h2>
<ul id="componentes_basicos_de_uma_rede_list">
	<li>Computadores servidores(arquivo, impress&atilde;o, firewall, aplicativos)</li>
	<ul>
		<li>Servidor especializado: Tem somente um servi&ccedil;o</li>
		<li>Servidor dedicado: S&oacute; &eacute; dedicado a ser servidor e nunca atuar&aacute; como cliente</li>
	</ul>
	<li>Computadores clientes</li>
	<li>Dispositivos de conectividade(Hub, Switch, Router)</li>
	<ul>
		<li>Brouter: Switch com fun&ccedil;&atilde;o de router</li>
		<li>Gateway: Equipamento que permite a comunica&ccedil;o entre 2 ou mais ambientes de TI</li>
		<li>Router: Permite a comunica&ccedil;&atilde;o entre redes</li>
		<li>Internet: V&aacute;rios roteadores ligados entre si</li>
	</ul>
	<li>Sistemas operacionais de rede</li>
	<li>Softwares, aplicativos e utilit&aacute;rios</li>
	<li>Cabeamento/Wireless</li>
</ul>
<a name="lan_man_wan">
<h2>LAN, MAN e WAN</h2>
<ul>
	<li><u>LAN</u>
		<a name="lan"></a>
		<ul>
			<li>S&atilde;o as chamadas redes locais. Interligam computadores em um espa&ccedil;o geograficamene restrito. Geralmente s&atilde;o privadas e permitem altas taxas de transmiss&atilde;o de dados.</li>
			<img src="imagens/imagem0003.jpeg">
		</ul>
	</li>
	<li><u>MAN</u>
		<a name="man"></a>
		<ul>
			<li>S&atilde;o as chamadas redes metropolitanas. Abrangem uma regi&atilde;o maior que a LAN e possibilitam a interliga&ccedil;&atilde;o com computadores em uma regi&atilde;o metropolitana.</li>
			<img src="imagens/imagem0004.jpeg">
		</ul>
	</li>
	<li><u>WAN</u>
		<a name="wan"></a>
		<ul>
			<li>S&atilde;o redes de longa dist&acirc;ncia que interligam computadores em um espa&ccedil;o geograficamente disperso, como por exemplo pa&iacute;ses.</li>
			<img src="imagens/imagem0005.jpeg">
		</ul>
	</li>
</ul>
<a name="protocolo_de_rede">
<h2>Protocolo de Rede</h2>
<ul>
	<li>Conjunto de regras, padr&otilde;es pr&eacute; estabelecidas para que a comunica&ccedil;&atilde;o entre equipamentos de TI possa ocorrer. Como exemplo: TCP/IP, IPX/SPX</li>
	<li>Padr&otilde;es de comunica&ccedil;&atilde;o tais como simplex, half-duplex, full-duplex, compactado, criptografado, EBCDIC, ASCII,...</li>
</ul>
<a name="formas_de_ligacao_ao_meio"></a>
<h2>Formas de Liga&ccedil;&atilde;o ao Meio</h2>
<ul>
	<li><u>Multiponto</u>
	<a name="multiponto"></a>
		<ul>
			<li>Tr&ecirc;s ou mais computadores ligados a um meio de comunica&ccedil;&atilde;o central</li>
			<img src="imagens/imagem0006.jpeg">
			<p><b>Enlace: Meio de transmiss&atilde;o utilizado pela informa&ccedil;&atilde;o</b></p>
			<li>3 ou mais equipamentos compartilham o mesmo enlace</li><br>
		</ul>
	</li>
	<li><u>Ponto a Ponto(Peer to peer)</u>
	<a name="peer_to_peer"></a>
		<ul>
			<li>Ocorre quando 2 equipamentos compartilham o mesmo meio de comunica&ccedil;&atilde;o(enlace)</li>
			<li>Vantagens: O rompimento de um enlace n&atilde;o interfere nos outros</li>
			<img src="imagens/imagem0007.jpeg">
		</ul>
	</li>
</ul>
<a name="objetivos_e_vantagens_de_implementacao_de_redes"></a>
<h2>Objetivos e Vantagens de Implementa&ccedil;&atilde;o de redes</h2>
<ul>
	<li><u>Compartilhamento de Hardware e Software</u>
	<a name="compartilhamento_de_hardware_e_software"></a></li>
	<img src="imagens/imagem0008.jpeg">
	<p>g: Mapeamento para diret&oacute;rio compartilhado. &Eacute; um drive l&oacute;gico e faz parte do HD do servidor</p>
	<p>Login script: Conjunto de comandos executados quando do login do usu&aacute;rio na rede</p>
	<p>Spool: Nesse caso seria a fila de impress&atilde;o</p>
	<img src="imagens/imagem0009.jpeg">
	<li><u>Plataforma para Downsizing e Rightsizing</u>
	<a name="plataforma_para_downsizing_e_rightsizing"></a>
		<ul>
			<li><u>Downsizing</u></li>
			<ul>
				<li>Redesenvolvimento da rede para a migra&ccedil;o de dados de um mainframe para um DB server(SGBD). &Eacute; uma migra&ccedil;&atilde;o de uma plataforma alta para plataforma baixa.</li>
				<li>Vantagem: Economia $$</li>
			</ul>
			<img src="imagens/imagem0010.jpeg">
			<li><u>Rightsizing</u></li>
			<ul>
				<li>Um projeto de rightsizing consiste na implanta&ccedil;&atilde;o e na utiliza&ccedil;&atilde;o das principais caracter&iacute;sticas de um ambiente de plataforma alta e baixa de forma que alguns modos do sistema rodam na plataforma alta e outros na baixa</li>
			</ul>
			<img src="imagens/imagem0011.jpeg">
			<li><u>Upsizing</u></li>
			<ul>
				<li>Projeto de migra&ccedil;&atilde;o de plataforma baixa para alta</li>
			</ul>
			<img src="imagens/imagem0012.jpeg">
		</ul>
	</li>
	<li><u>Recursos para implementa&ccedil;&atilde;o de correio eletr&ocirc;nico, agenda eletr&ocirc;nica corporativa, workflow, workgroup, portais, sistemas SSO e ERP(Sistemas de gest&atilde;o empresarial)</u>
	<a name="impl_email_workflow_workgroup"></a>
	<ul>
		<li><u>Software de Workflow:</u> Automatiza algum processo pela rede</li>
		<li><u>ERP:</u> Num &uacute;nico sistema se tem todos os modos de gest&atilde;o da empresa</li>
		<li>Governan&ccedil;a de TI: Melhores pr&aacute;ticas para administrar a TI</li>
		<li>Portal: Pode montar as p&aacute;ginas de forma diferenciada.(Email, apps)</li>
	</ul>
	<img src="imagens/imagem0013.jpeg"></li>
</ul>
<a name="comunicacao_simplex_halfduplex_fullduplex">
<h2>Comunica&ccedil;&atilde;o Simplex, Half Duplex e Full Duplex</h2>
<ul>
	<li><u>Simplex</u></li>
	<a name="simplex"></a>
	<ul>
		<li>Comunica&ccedil;&atilde;o em um &uacute;nico sentido do enlace</li>
	</ul>
	<img src="imagens/imagem0014.jpeg">
	<li><u>Half Duplex</u></li>
	<a name="half_duplex"></a>
	<ul>
		<li>Comunica&ccedil;&atilde;o nos dois sentidos do enlace, mas n&atilde;o simultaneamente</li>
	</ul>
	<img src="imagens/imagem0015.jpeg">
	<li><u>Full Duplex</u></li>
	<a name="full_duplex"></a>
	<ul>
		<li>Comunica&ccedil;&atilde;o nos dois sentidos do enlace, inclusive podendo ser simultaneamente</li>
	</ul>
	<img src="imagens/imagem0016.jpeg">
</ul>
<a name="backbone">
<h2>Backbone</h2>
<ul>
	<li><u><b>Conceito: </b></u>Chamamos de Backbone o principal meio de comunica&ccedil;&atilde;o da rede. Tamb&eacute;m conhecido por espinha dorsal da rede. Existem dois tipos de Backbone</li>
	<li><u><b>Backbone distribu&iacute;do</b></u></li>
	<img src="imagens/imagem0017.jpeg">
	<ul>
		<li>Conjunto de equipamentos de conectividade interligados formando o principal enlace da rede.</li>
	</ul>
	<li><u><b>Backbone Concentrado: </b></u>Principal equipamento de conectividade de uma rede que concentra as comunica&ccedil;&otilde;es entre os demais equipamentos de conectividade da rede</li>
	<li><u><b>Backplane: </b></u>Barramento interno ao switch para garantir a alta velocidade para comunica&ccedil;&atilde;o entre as portas do switch</li>
</ul>
<a name="firewall">
<h2>Firewall</h2>
<ul>
	<li>Conjunto de Hardware ou software destinado a proteger a rede, bancos de dados contra acessos n&atilde;o autorizados ou indevidos</li>
	<li>Appliance: Equipamento voltado a ser somente Firewall</li>
	<li>Regras de Firewall: Origem, destino, protocolo, a&ccedil;&atilde;o e log</li>
	<li>Arquitetura de Firewall
		<ul>
			<li>Cl&aacute;ssica</li>
			<img src="imagens/imagem0018.jpeg">
			<li>Redundante</li>
			<ul>
				<li>Load Balance: Distribui&ccedil;&atilde;o do trabalho de firewall entre os firewalls</li>
			</ul>
			<img src="imagens/imagem0019.jpeg">			
			<li>Firewall interno</li>
			<ul>
				<li>O firewall &eacute; uma segunda camada de seguran&ccedil;a dos server farm</li>
			</ul>
			<img src="imagens/imagem0020.jpeg">			
			<li>Personal Firewall</li>
			<img src="imagens/imagem0021.jpeg">
		</ul>
	</li>
</ul>
<a name="dmz">
<h2>Zona desmilitarizada</h2>
<ul>
	<li><u>Conceito:</u> Segmento de rede com acesso autorizado por regras espec&iacute;ficas de libera&ccedil;&atilde;o do Firewall. Segmento da rede onde s&atilde;o instalados os equipamentos com permiss&atilde;o de acesso pela internet, como por exemplo o servidor web(www), correio eletr&ocirc;nico, DNS, dentre outros</li>
	<li>Rede desprotegida, conectada ao firewall da rede(segmento de rede)</li>
	<li>Disponibiliza servi&ccedil;os desejados que o usu&aacute;rio acesse</li>
	<li>Honey Pot: DMZ virtual, criada no firewall para confundir um posss&iacute;vel atacante</li>
	<img src="imagens/imagem0022.jpeg">
</ul>
<a name="hub_switch_roteador">
<h2>Hub, Switch e Roteador</h2>
<ul>
	<li><u>Hub: </u>
		<ul>
			<li>Equipamento de conectividade que n&atilde;o segmenta a rede, corresponde a um barramento &uacute;nico e possui um &uacute;nico dom&iacute;nio de colis&otilde;es</li>
			<li>Est&aacute; em desuso, n&atilde;o segmenta a rede(todas as portas escutam todas as comunica&ccedil;&otilde;es</li>
			<li>Se a porta 1 comunica, a porta 3 tamb&eacute;m ouve e isso pode causar muitas colis&otilde;es.</li>
			<li>Dom&iacute;nio &uacute;nico de colis&otilde;es</li>
			<img src="imagens/imagem0023.jpeg">
		</ul>
	</li>
	<li><u>Switch: </u>
		<ul>
			<li>Equipamento de conectividade que segmenta a rede</li>
			<li>Cada porta do switch corresponde a um dom&iacute;nio de colis&atilde;o</li>
			<li>Permite uma melhoria de performance em rela&ccedil;&atilde;o ao tipo de funcionamento do hub</li>
			<li>Segmenta a rede: as comunica&ccedil;&otilde;es de cada porta &eacute; independente)cada porta &eacute; um dom&iacute;nio de colis&atilde;o</li>
			<img src="imagens/imagem0024.jpeg">
			<li>Endere&ccedil;os MAC</li>
		</ul>
	</li>
	<li><u>Roteador: </u>
		<ul>
			<li>Equipamento de conectividade que permite o roteamento de pacotes de dados entre redes de computadores</li>
			<li>Formas de funcionamento: Est&aacute;tico e Din&acirc;mico</li>
			<img src="imagens/imagem0025.jpeg">
			<li>M&aacute;scara de rede</li>
			<p>255.255.0.0</p>
			<img src="imagens/imagem0026.jpeg">
			<img src="imagens/imagem0027.jpeg">
		</ul>
	</li>
</ul>
<a name="projeto_de_rede">
<h2>Projeto de Rede</h2>
<p>etapas: Projeto l&oacute;gico e f&iacute;sico</p>
<ul>
	<a name="projeto_logico"></a>
	<li><u>Projeto L&oacute;gico</u></li>
	<ul>
		<b><u>12.1.1</u></b>
		<li>Computadores clientes</li>
		<li>Hardware</li>
		<li>Software</li>
		<li>Configura&ccedil;&atilde;o</li>
		<b><u>12.1.2</u></b>
		<li>Computadores servidores</li>
		<li>Hardware</li>
		<li>Software</li>
		<li>Configura&ccedil;&atilde;o</li>
		<li>Tipos de servidores/servi&ccedil;os</li>
		<b><u>12.1.3</u></b>
		<li>Cabeamento</li>
		<ul>
			<li>Projeto de cabeamento estruturado(dispositivos,racks, patch panel, tipos de cabeamento vertical e horizontal, plantas, cortes</li>
		</ul>
		<b><u>12.1.4</u></b>
		<li>Seguran&ccedil;a</li>
		<ul>
			<li>Mapa de permiss&otilde;es</li>
			<li>Arquitetura de Firewall</li>
			<img src="imagens/imagem0028.jpeg">
			<li>Estrutura de backup</li>
			<li>Pol&iacute;tica de seguran&ccedil;a</li>
			<li>Plano de Contig&ecirc;ncia</li>
			<li>Seguran&ccedil;a f&iacute;sica: Datacenter</li>
			<li>Software de gerenciamento</li>
		</ul>
		<b><u>12.1.5</u></b>
		<li>Defini&ccedil;&atilde;o do site/portal/app de gest&atilde;o</li>
		<li>SSO</li>
		<li>Defini&ccedil;&atilde;o do ERP</li>
		<b><u>12.1.6</u></b>
		<li>Cronograma f&iacute;sico</li>
		<b><u>12.1.7</u></b>
		<li>Mapa de testes</li>

	</ul>
	<a name="projeto_fisico"></a>
	<li><u>Projeto F&iacute;sico</u></li>
	<ul>
		<li>Aquisi&ccedil;&atilde;o, instala&ccedil;&atilde;o, configura&ccedil;&atilde;o, mapa de testes, opera&ccedil;&atilde;o assistida, manuten&ccedil;&atilde;o</li>
	</ul>
</ul>
<a name="internet_intranet_extranet">
<h2>Internet/Intranet/Extranet</h2>
<img src="imagens/imagem0029.jpeg">
<ul>
	<li>Conjunto mundial de gateways que utilizam o protocolo TCP/IP para permitir a comunica&ccedil;&atilde;o entre redes</li>

	<li><b><u>Intranet</u></b></li>
	<ul>
		<li>Rede interna de uma empresa que utiliza os conceitos e aplica&ccedil;&otilde;es da internet para a disponibiliza&ccedil;&atilde;o de servi&ccedil;os</li>
	</ul>
	<li><b><u>Extranet</u></b></li>
	<ul>
		<li>Extens&atilde;o da intranet corporativa que utiliza tecnologia web para permitir a conex&atilde;o segura entre redes de empresas, fornecedores e clientes</li>
		<li>Gateway: Conjunto de software e hardware destinados a conex&atilde;o de dois ou mais ambientes computacionais</li>
	</ul>
</ul>
<a name="topologia_de_redes">
<h2>Topologia de Rede</h2>

<ul>
	<li>Existe dois tipos de topologia, a l&oacute;gica e a f&iacute;sica</li>
	<li><u><b>Topologia f&iacute;sica</u></b></li>
	<ul>
		<li>Chamamos de topologia f&iacute;sica ao layout dos equipamentos em uma rede, a forma, disposi&ccedil;&atilde;o geogr&aacute;fica das m&aacute;quinas na rede, a disposi&ccedil;&atilde;o f&iacute;sica de como eles est&atilde;o conectados</li>
		<li><u><b>Topologia barra ou barramento</b></u></li>
		<ul>
			<img src="imagens/imagem0030.jpeg">
			<li>Todos os equipamentos est&atilde;o conectados num mesmo meio de comunica&ccedil;&atilde;o</li>
			<li>Paradas no meio de comunica&ccedil;&atilde;o barra, provocam paradas em toda a rede</li>
			<li>A barra corresponde a um &uacute;nico dom&iacute;nio de colis&otilde;es</li>
		</ul>
		<li><u><b>Topologia Estrela</b></u></li>
		<img src="imagens/imagem0031.jpeg">
		<ul>
			<li>As m&aacute;quinas ficam conectadadas no equipamento (n&oacute;) central</li>
			<li>Paradas no equipamento central param a rede</li>
			<li>Paradas nos n&oacute;s secund&aacute;rios n&atilde;o interrompem a rede, apenas o n&oacute; em quest&atilde;o</li>
			<li>Performance depende muito do n&oacute; central</li>
		</ul>
		<li><u><b>Topologia Anel</b></u></li>
		<img src="imagens/imagem0032.jpeg">
		<ul>
			<li>Paradas no anel interrompem a rede</li>
			<li>As placas de rede podem assumir 3 valores distintos: escuta, transmiss&atilde;o e bypass</li>
			<li>Quando uma mensagem &eacute; enviada pelo anel, ela circula pelo mesmo e &eacute; copiada pelo n&oacute; de destino e retirada pelo n&oacute; de origem</li>
			<li>Pode-se utilizar o anel duplo para redundancia da rede</li>
			<img src="imagens/imagem0033.jpeg">
			<li>O anel secund&aacute;rio entra em funcionamento em caso de falha do primeiro</li>
		</ul>
		<li>Topologia malha(mash)</li>
	</ul>
	<li><u><b>Topologia l&oacute;gica</u></b></li>
	<ul>
		<li>Refere-se &agrave; uma forma, &agrave;s regras de comunica&ccedil;&atilde;o que regem as transmiss&otilde;es em uma topologia f&iacute;sica</li>
		<ul>
			<li><u><b>Topologia l&oacute;gica barra</b></u></li>
			<ul>
				<li>Quando um n&oacute; transmite, todos os n&oacute;s do mesmo barramento escutam a transmiss&atilde;o</li>
				<li>Somente 2 equipamentos podem estar em comunica&ccedil;&atilde;o em um mesmo barramento</li>
				<li>Quando 2 ou mais equipamentos transmitem simultaneamente h&aacute; colis&atilde;o (protocolo CSMA-CD)</li>
			</ul>
			<li><u><b>Topologia l&oacute;gica anel</b></u></li>
			<ul>
				<li>Somente um equipamento transmite por vez</li>
				<li>Somente equipamentos que possuem o token(permiss&atilde;o de transmiss&atilde;o) pode transmitir(token pass)-&gt;IBM</li>
			</ul>
		</ul>
	</ul>
</ul>
<a name="sop_de_rede">
<h2>Estrutura de um SOP de Rede</h2>
	
<ul>
	<li><u><b>Intera&ccedil;&atilde;o direta com o hardware</u></b></li>
</ul>
</body>
</html>